evgmolt/Tonometer/gd32f303_v1/src/main.c
/*!
    \file    main.c
    \brief   USB CDC ACM device

    \version 2020-08-01, V3.0.0, firmware for GD32F30x
    \version 2022-06-10, V3.1.0, firmware for GD32F30x
*/

/*
    Copyright (c) 2022, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32f30x.h"
#include "cdc_acm_core.h"
#include "usbd_hw.h"
#include "gd32f30x_it.h"
#include "string.h"

#include "main.h"
#include "systick.h"
//#include "math.h"

#include "ili9341.h"
#include "fonts.h"
#include "ili9341_touch.h"

//#include "img_all.h"
#include "bat_clr_44_24.h"
#include "bat_dif_7_22.h"
#include "heart_31_30.h"
#include "bluetooth_15_24.h"
#include "gsm_29_18.h"
#include "heartX3_45_27.h"
#include "SYS_46_36.h"
#include "DIA_45_35.h"
#include "text_H_GREEN.h"
#include "text_H_RED.h"
#include "text_H_YELLOW.h"
#include "text_L_BLACK.h"

//#include ""

#define  BKP_DATA_REG_NUM              42
#define FMC_PAGE_SIZE           ((uint16_t)0x30U)
#define FMC_WRITE_START_ADDR    ((uint32_t)0x0807E000U)
#define FMC_WRITE_END_ADDR      ((uint32_t)0x0807E030U)


#define NCoef 2 

/* enter the second interruption,set the second interrupt flag to 1 */
__IO uint32_t timedisplay;


#define I2C0_OWN_ADDRESS7      0x72 
#define I2C0_SLAVE_ADDRESS7    0x91 

extern uint8_t EN_BUTT_FLAG;
extern uint8_t EN_BUTT_count;
extern uint8_t Wave_ind_FLAG;
extern uint8_t Wave_detect_FLAG;
extern int16_t T_Wave;
extern double _detectLevel;
extern int16_t silence_time_start;
extern int16_t puls_buff[50];
extern uint8_t puls_counter;
extern double _maxD;
extern int16_t _detectLevel_start;
extern uint8_t UART0_buff[200];
extern uint8_t UART0_count;
extern uint8_t finish_6_flag;

double puls_out=0;
uint8_t puls_cur_counter=0;

uint32_t *ptrd;
uint32_t address = 0x00000000U;
uint32_t SERIAL[9]   = {'0','2','0','2','2','2','0','0','1'};
/* calculate the number of page to be programmed/erased */
uint32_t PageNum = (FMC_WRITE_END_ADDR - FMC_WRITE_START_ADDR) / FMC_PAGE_SIZE;
/* calculate the number of page to be programmed/erased */
uint32_t WordNum = ((FMC_WRITE_END_ADDR - FMC_WRITE_START_ADDR) >> 2);

extern uint8_t UART0_flag;

int16_t puls_buff_NEW[50]={0};
int16_t puls_buff_NEW_MIN[50]={0};
int16_t puls_buff_AMP[50]={0};
int16_t puls_buff_AMP_MIN[50]={0};

uint16_t frequency=128;

uint16_t Lo_thresh_default = 0x8000;
uint16_t Hi_thresh_default = 0x0000;

uint8_t Hi_ADS1115_config = 0b10001111;
uint8_t Lo_ADS1115_config = 0b11100100;

uint8_t ADS1115_FLAG=0;

extern const int LoLimit;  
extern const int HiLimit; 

int16_t PSys = 0;
int16_t PDia = 0;
uint16_t m_ss;
uint16_t m_mm;
uint16_t m_hh;

int indexPSys = 0;
int indexPDia = 0;
int16_t XMax = 0;

int DerivativeShift = 13;
int DerivativeAverageWidth = 4;

int16_t current_pressure=0;
int16_t ArrayForAver[AVER_SIZE] = {0};
int8_t ArrayForAverIndex = 0;

int16_t i2c_out=0;
int i2c_out_K=0;
uint8_t indicate_charge_toggle=1;

uint16_t cur_day=13, cur_month=12, cur_year=2022;
uint32_t cur_thh=0,cur_tmm=0,cur_tss=0;
uint32_t cur_tim=0;

uint8_t bluetooth_status=0;
uint8_t bonus_byte=0;
/*
mode device:
0 - init start;
1 - start screen
2 - key off
3 - pumping measurement
4 - usb charging
5 - pressure test
6 - measurement
7 - send save buff msg
8 -
*/
uint8_t mode = INIT_START;

uint8_t sim800_FLAG=0;
uint8_t rang_bat_old=99;

uint8_t i2c_transmitter[16];
uint8_t i2c_receiver[16];

uint8_t send_buff[100]={0};

uint8_t buff097[10]={0};

usb_dev usbd_cdc;

uint16_t adc_value[8];
uint16_t num_string=0;

uint16_t count_send_bluetooth=0;
uint16_t size_pack=20;

short int save_clear[10000]={0};
uint32_t main_index=0;
short int save_dir[10000]={0};
uint32_t save_dir_counter=0;
short int EnvelopeArray[10000]={0};

uint32_t send_counter=0;
double rate=18.69;

void timer_config_1(void)
{
    /* ----------------------------------------------------------------------------
    TIMER1 Configuration: 
    TIMER1CLK = SystemCoreClock/(12000*10000) = 1s).
    ---------------------------------------------------------------------------- */
    timer_parameter_struct timer_initpara;
    rcu_periph_clock_enable(RCU_TIMER1);
    timer_deinit(TIMER1);
    /* initialize TIMER init parameter struct */
    timer_struct_para_init(&timer_initpara);
    /* TIMER1 configuration */
    timer_initpara.prescaler         = 119;//99;
    timer_initpara.alignedmode       = TIMER_COUNTER_EDGE;
    timer_initpara.counterdirection  = TIMER_COUNTER_UP;
    timer_initpara.period            = 9999;
    timer_initpara.clockdivision     = TIMER_CKDIV_DIV1;
    timer_init(TIMER1, &timer_initpara);

    timer_interrupt_flag_clear(TIMER1, TIMER_INT_FLAG_UP);
    timer_interrupt_enable(TIMER1, TIMER_INT_UP);
    timer_enable(TIMER1);
}

void nvic_config_1(void)
{
    nvic_priority_group_set(NVIC_PRIGROUP_PRE1_SUB3);
    nvic_irq_enable(TIMER1_IRQn, 1, 1);
}

void timer_config_2(void)
{
    /* ----------------------------------------------------------------------------
    TIMER2 Configuration: 
    TIMER1CLK = SystemCoreClock/(1000*f) = ... s).
    ---------------------------------------------------------------------------- */
    timer_parameter_struct timer_initpara;

