evgmolt/Tonometer/gd32f303_v1/src/main.c
    rcu_periph_clock_enable(RCU_TIMER2);

    timer_deinit(TIMER2);
    /* initialize TIMER init parameter struct */
    timer_struct_para_init(&timer_initpara);
    /* TIMER1 configuration */
    timer_initpara.prescaler         = 999;
    timer_initpara.alignedmode       = TIMER_COUNTER_EDGE;
    timer_initpara.counterdirection  = TIMER_COUNTER_UP;
    timer_initpara.period            = (120000/frequency)-1;//= 599; 479
    timer_initpara.clockdivision     = TIMER_CKDIV_DIV1;
    timer_init(TIMER2, &timer_initpara);

    //timer_interrupt_flag_clear(TIMER2, TIMER_INT_FLAG_UP);
    //timer_interrupt_enable(TIMER2, TIMER_INT_UP);
    //timer_enable(TIMER2);
}

void nvic_config_2(void)
{
    nvic_priority_group_set(NVIC_PRIGROUP_PRE1_SUB3);
    nvic_irq_enable(TIMER2_IRQn, 1, 1);
}



int main(void)
{
		nvic_configuration();	  // RTC
		time_init();						// RTC
	
		GPIO_config();	
		systick_config();

		
		boot_mode();		

    rcu_config();																	// USB
    gpio_config();																// USB    
    usbd_init(&usbd_cdc, &cdc_desc, &cdc_class);	// USB 
    nvic_config();																// USB     
    usbd_connect(&usbd_cdc);											// USB 
	
		nvic_config_1();		// timer 1
		timer_config_1();		// timer 1
	
		nvic_config_2();		// timer 2
		timer_config_2();		// timer 2
		
		
		i2c_config();																												//I2C ADS1115
		ADS1115_config(0b00000010, 0x00, 0x00);															//Lo
		ADS1115_config(0b00000011, 0xFF, 0xFF);															//Hi
		ADS1115_config(0b00000001, Hi_ADS1115_config, Lo_ADS1115_config);		//preconfig
		//ADS1115_read_IT();
		//i2c_init();

		ADC_rcu_config();																				// ADC0
		ADC_gpio_config();																			// ADC0
		dma_config();																						// ADC0
		adc_config();																						// ADC0
		adc_software_trigger_enable(ADC0, ADC_REGULAR_CHANNEL);	// ADC0
		
		nvic_irq_enable(USART1_IRQn, 0, 0);							// UART1
		usart_config_1();																// UART1
		usart_interrupt_enable(USART1, USART_INT_RBNE);	// UART1
		
		nvic_irq_enable(USART0_IRQn, 0, 0);							// UART0
		usart_config_0();																// UART0
		usart_interrupt_enable(USART0, USART_INT_RBNE);	// UART0
		
    //while (USBD_CONFIGURED != usbd_cdc.cur_status) {/* wait for standard USB enumeration is finished */}	
		
		ILI9341_Init();
		ILI9341_Touch_init();
		
		if (mode == USB_CHARGING){
				ILI9341_FillScreen(ILI9341_BLACK);
				ILI9341_FillRectangle(50, 150, 150, 70, ILI9341_BLACK);
				ILI9341_FillRectangle(52, 152, 146, 66, ILI9341_WHITE);
				ILI9341_FillRectangle(40, 150+35-20, 10, 40, ILI9341_BLACK);
				ILI9341_FillRectangle(40+2, 150+35-20+2, 10-2, 40-4, ILI9341_WHITE);
		}
		else ILI9341_FillScreen(ILI9341_WHITE);
		
		button_interrupt_config();
		
		uint8_t buff2[10]={0};
		EN_BUTT_FLAG=1;
		
			

		if (mode == INIT_START){		
		ILI9341_DrawImage(72, 279, 31, 30, (const uint16_t*)heart);
		ILI9341_DrawImage(5, 255, 15, 24, (const uint16_t*)bluetooth);
		ILI9341_DrawImage(22, 258, 29, 18, (const uint16_t*)gsm);
		ILI9341_DrawImage(65, 245, 45, 27, (const uint16_t*)heartX3);
		ILI9341_DrawImage(5, 10, 46, 36, (const uint16_t*)SYS);
		ILI9341_DrawImage(5, 133, 45, 35, (const uint16_t*)DIA);
		print_num_H(888,235,10,YELLOW);
		print_num_H(888,235,120,RED);
		print_num_H(888,235,250,BLACK);		
		}
		else if (mode == PRESSURE_TEST){
				ILI9341_FillRectangle(70, 150, 100, 50, ILI9341_WHITE);
		}	
		
		// waiting for button release, or sitting mode?
		while (gpio_input_bit_get(GPIOC, GPIO_PIN_8)==1){}	
		delay_1ms(300);
		while (gpio_input_bit_get(GPIOC, GPIO_PIN_8)==1){}
		
		EN_BUTT_FLAG=0;	
		
			
		pump_OFF;
		valve_1_OFF;
		valve_2_OFF;	
		
		/*
		my_send_string_UART_0("AT+NAME=TONOMETER\0\n",strlen("AT+NAME=TONOMETER\0\n"));
		delay_1ms(1000);
		my_send_string_UART_0("AT+RX\0\n",strlen("AT+RX\0\n"));
		delay_1ms(1000);
		my_send_string_UART_0("AT+MODE=?\0\n",strlen("AT+MODE=?\0\n"));		
		delay_1ms(1000);
		//my_send_string_UART_0("AT+ADDR=1234567890AB\0\n",strlen("AT+ADDR=1234567890AB\0\n"));		
		//delay_1ms(1000);
		my_send_string_UART_0("AT+ROLE=?\0\n",strlen("AT+ROLE=?\0\n"));		
		delay_1ms(1000);
		uint8_t UP[10]={0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
				
		for (int i=0;i<10;i++){
				usart_data_transmit(USART0, (uint8_t)UP[i]);
				while(RESET == usart_flag_get(USART0, USART_FLAG_TBE));	
		}
		*/	
		//my_send_string_UART_0("AT\0\n",strlen("AT\0\n"));	
		if (sim800_FLAG) {}	  //GSM module ...		
		delay_1ms(1000);
		if (mode!=4) {			
				ILI9341_FillRectangle(72, 279, 31, 30, ILI9341_WHITE);
				ILI9341_FillRectangle(5, 255, 15, 24, ILI9341_WHITE);
				ILI9341_FillRectangle(22, 258, 29, 18, ILI9341_WHITE);
				ILI9341_FillRectangle(65, 245, 45, 27, ILI9341_WHITE);
				ILI9341_FillRectangle(5, 10, 46, 36, ILI9341_WHITE);
				ILI9341_FillRectangle(5, 133, 45, 35, ILI9341_WHITE);				

				ILI9341_FillRectangle(55, 10, 180, 106, ILI9341_WHITE);
				ILI9341_FillRectangle(55, 120, 180, 106, ILI9341_WHITE);
				ILI9341_FillRectangle(112, 250, 123, 64, ILI9341_WHITE);	
		}		
			
		i2c_calibration();	
		
		//uint16_t x, y;
		
		fmc_program_check();
		delay_1ms(200);
		str_clear(UART0_buff,200);		
		
		/* PMU lock enable */
    rcu_periph_clock_enable(RCU_PMU);																// 
    /* BKP clock enable */																					//
    rcu_periph_clock_enable(RCU_BKPI);															// 
    /* enable write access to the registers in backup domain */			//	backap data (save data)
    pmu_backup_write_enable();																			// 
    /* clear the bit flag of tamper event */												//
    bkp_flag_clear(BKP_FLAG_TAMPER);																//
			
		//time_set(23,59,55);
		//write_backup_register(cur_day, cur_month, cur_year);		
		
//if (mode == INIT_START) mode = START_SCREEN;
		timer_1_start();
	
    while (1) {	

			switch (mode)
			{
				case INIT_START:
					if (!button_pressed) {
						mode = START_SCREEN;
						button_released = 0;
  					button_pressed_counter = 0;
					}
					break;
				case START_SCREEN:
					TFT_print();
					if (button_released) {
//							timer_1_stop();							
							ILI9341_FillRectangle(0, 0, 240, 280, ILI9341_WHITE);							
							ILI9341_FillRectangle(100, 270, 140, 50, ILI9341_WHITE);						

						
