evgmolt/Tonometer/gd32f303_v1/src/main.c
							count_send_bluetooth=0;
						
							current_pressure=0;
							i2c_calibration();
							pump_ON;
							valve_1_ON;
							valve_2_ON;
							_lockInterval=50;
							sector_start_scan=0;
							main_index = 0;		
							save_dir_counter=0;		
							Wave_detect_FLAG=0;	
							_maxD=0;		
							_detectLevel_comp_UP=15;
							_detectLevel=_detectLevel_start;
							silence_time_start=0;
							puls_counter=0;			
							detect_FLAG=0;
							timer_2_start();
							finish_6_flag=0;
							mode = PUMPING_MANAGEMENT;
							button_released = 0;
							button_pressed_counter = 0;
					}
					break;
				case KEY_OFF:
					device_OFF();
					break;
				case PUMPING_MANAGEMENT:
					ILI9341_FillRectangle(65, 245, 45, 27, ILI9341_WHITE);
					if (button_released)
					{
							mode = START_SCREEN;
							pump_OFF;
							valve_1_OFF;
							valve_2_OFF;
							button_released = 0;
							button_pressed_counter = 0;
					}
					if (current_pressure>=0 & current_pressure<400) print_num_H(GetAver(current_pressure),235,120,GREEN);
				
					if (current_pressure >= MAX_ALLOWED_PRESSURE) {
							_detectLevel = _detectLevel_start;						
							main_index=0;		
							save_dir_counter=0;		
							Wave_detect_FLAG=0;	
							silence_time_start=0;
							_maxD=0;							
							puls_counter=0;						
							mode = MEASUREMENT;		
					}						
					break;
				case USB_CHARGING:
					if (gpio_input_bit_get(GPIOB, GPIO_PIN_8)==0) indicate_charge_toggle=1;
					print_bat_charg();				
					delay_1ms(2000);				
					if (gpio_input_bit_get(GPIOC, GPIO_PIN_10)==0) device_OFF();						
					break;
				case PRESSURE_TEST:
					convert_NO_save();
					print_num_H(current_pressure,235,10,YELLOW);
					//print_num_H(current_pressure,235,120,RED);
					usb_send_16(i2c_out,0);
					delay_1ms(200);
					time_display(rtc_counter_get());
					break;
				case MEASUREMENT:
					if (current_pressure>=0 & current_pressure<400) print_num_H(current_pressure,235,120,GREEN);
					pump_OFF;
					valve_2_OFF;
					if (main_index>1+size_pack*(count_send_bluetooth+1)){						
							uint8_t c_summ=0;							
							uint8_t cur_buff_ble[400]={'0','2',0x05,count_send_bluetooth&0xFF,(count_send_bluetooth>>8)&0xFF,size_pack};
							
							for (int f=0;f<size_pack;f++){
									int16_t cur_press=(((save_clear[count_send_bluetooth*size_pack+f]-i2c_out_K)*100)/rate);
									cur_buff_ble[6+f*2]=cur_press&0xFF;
									cur_buff_ble[6+f*2+1]=(cur_press>>8)&0xFF;
							}							
							for (int f=0;f<size_pack*2+6;f++){
									c_summ+=cur_buff_ble[f];
							}
							cur_buff_ble[size_pack*2+6]=c_summ;
							my_send_string_UART_0(cur_buff_ble,size_pack*2+6+1);
							count_send_bluetooth++;
					}
					if (current_pressure <= STOP_MEAS_LEVEL){
							//timer_2_stop();						                           ///////////////////////////////////////////////

  						for (int i = 0; i < AVER_SIZE; i++) {
								ArrayForAver[i] = 0;
							}
						
							ILI9341_FillRectangle(55, 10, 180, 106, ILI9341_WHITE);
							ILI9341_FillRectangle(55, 120, 180, 106, ILI9341_WHITE);
							ILI9341_FillRectangle(112, 250, 123, 64, ILI9341_WHITE);	
						
							str_clear(EnvelopeArray,10000);
							GetArrayOfWaveIndexes(save_dir, puls_buff, puls_buff_NEW);
							f_sorting_MAX();
							CountEnvelopeArray(puls_buff_NEW,puls_buff_AMP);
							f_PSys_Dia();
							puls_convert();	
							bonus_byte=0;
							if (main_index>1000 & PSys>10 & PSys<300 & PDia>10 & PDia<300 & puls_out>10 & puls_out<300) {
									ILI9341_DrawImage(5, 10, 46, 36, (const uint16_t*)SYS);
									ILI9341_DrawImage(5, 133, 45, 35, (const uint16_t*)DIA);	
									print_SIS(PSys);
									print_DIA(PDia);									
									print_num_H((int16_t)puls_out,235,250,BLACK);
								
									cur_tim = rtc_counter_get();
									m_hh = cur_tim / 3600;
									m_mm = (cur_tim % 3600) / 60;
									m_ss = (cur_tim % 3600) % 60;
									check_backup_register(&cur_day, &cur_month, &cur_year);
									if 	(cur_year>=255)	cur_year-=2000;
									//send_result_measurement(14, 15, 16, 17, 18, 19, 20, 21, 22, 23);																							
							}
							else {
									bonus_byte|=0x80;
									print_error(4);							
							}
							send_result_measurement((uint8_t)cur_day, (uint8_t)cur_month, (uint8_t)cur_year, (uint8_t)m_ss, (uint8_t)m_mm, (uint8_t)m_hh, (uint8_t)PSys, (uint8_t)PDia, (uint8_t)puls_out,bonus_byte);
							
							valve_1_OFF;
							valve_2_OFF;
							mode = SEND_SAVE_BUFF_MSG;								
							timer_1_start();
					}					
					break;
				case SEND_SAVE_BUFF_MSG:
					break;
			}
			
			if (UART0_flag==1){					
					for (int w=0;w<200;w++){
							if (finder_msg(UART0_buff)){																	
										ILI9341_FillRectangle(1, 1, 100, 100, ILI9341_RED);															
							}
							if (finder(UART0_buff, "OFF",0,&num_string)) {
									ILI9341_FillRectangle(1, 1, 100, 100, ILI9341_WHITE);
							}
					}
					UART0_flag=0;
			}
			
		//if (bluetooth_status) ILI9341_DrawImage(5, 255, 15, 24, (const uint16_t*)bluetooth);			
		//else ILI9341_FillRectangle(5, 255, 15, 24, ILI9341_WHITE);		
			
			if (Wave_ind_FLAG){				
					ILI9341_DrawImage(72, 279, 31, 30, (const uint16_t*)heart);
					delay_1ms(200);
					ILI9341_FillRectangle(72, 279, 31, 30, ILI9341_WHITE);
					Wave_ind_FLAG=0;
			}
						
			if (0U == cdc_acm_check_ready(&usbd_cdc)) {
					cdc_acm_data_receive(&usbd_cdc);
			} else {
					cdc_acm_data_send(&usbd_cdc);
			}			
    }
}

int16_t GetAver(int16_t nextValue)
{
	ArrayForAver[ArrayForAverIndex] = nextValue;
	ArrayForAverIndex++;
	if (ArrayForAverIndex > AVER_SIZE - 1) ArrayForAverIndex = 0;
	int16_t sum = 0;
	for (int i = 0; i < AVER_SIZE; i++) sum += ArrayForAver[i];
	return sum / AVER_SIZE;
}

void print_num_H(int16_t num, uint16_t X0, uint16_t Y0, uint8_t color){
	double now=0;
	uint16_t now1=0;
	uint8_t max;
	if (num>=100)max=3;
	else if (num>=10) {
		max=2;
		if (color==BLACK) ILI9341_FillRectangle(X0-41*3, Y0, 41, 64, ILI9341_WHITE);
		else 							ILI9341_FillRectangle(X0-60*3, Y0, 60, 106, ILI9341_WHITE);
	}
	else {
		max=1;
		if (color==BLACK) ILI9341_FillRectangle(X0-41*3, Y0, 82, 64, ILI9341_WHITE);
		else 							ILI9341_FillRectangle(X0-60*3, Y0, 120, 106, ILI9341_WHITE);
	}
	
	
	
