evgmolt/Tonometer/gd32f303_v1/src/main.c
	for (int g=0;g<max;g++){
			now=pow(10,g);
			now1=now;			
			switch ((num/now1)%10)	{	
				case 0:					
					if (color==GREEN)				ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)G_0);
					else if (color==RED) 		ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)R_0);
					else if (color==YELLOW) ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)Y_0);
					else if (color==BLACK) 	ILI9341_DrawImage(X0-41-g*41, Y0, 41, 64, (const uint16_t*)B_L_0);
				break;
				case 1:
				 	if (color==GREEN)				ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)G_1);
					else if (color==RED) 		ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)R_1);
					else if (color==YELLOW) ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)Y_1);
					else if (color==BLACK) 	ILI9341_DrawImage(X0-41-g*41, Y0, 41, 64, (const uint16_t*)B_L_1);
				break;
				case 2:
				 	if (color==GREEN)				ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)G_2);
					else if (color==RED) 		ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)R_2);
					else if (color==YELLOW) ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)Y_2);
					else if (color==BLACK) 	ILI9341_DrawImage(X0-41-g*41, Y0, 41, 64, (const uint16_t*)B_L_2);
				break;
				case 3:
					if (color==GREEN)				ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)G_3);
					else if (color==RED) 		ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)R_3);
					else if (color==YELLOW) ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)Y_3);
					else if (color==BLACK) 	ILI9341_DrawImage(X0-41-g*41, Y0, 41, 64, (const uint16_t*)B_L_3);
				break;
				case 4:
					if (color==GREEN)				ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)G_4);
					else if (color==RED) 		ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)R_4);
					else if (color==YELLOW) ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)Y_4);
					else if (color==BLACK) 	ILI9341_DrawImage(X0-41-g*41, Y0, 41, 64, (const uint16_t*)B_L_4);
				break;
				case 5:
					if (color==GREEN)				ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)G_5);
					else if (color==RED) 		ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)R_5);
					else if (color==YELLOW) ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)Y_5);
					else if (color==BLACK) 	ILI9341_DrawImage(X0-41-g*41, Y0, 41, 64, (const uint16_t*)B_L_5);
				break;
				case 6:
					if (color==GREEN) 			ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)G_6);
					else if (color==RED) 		ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)R_6);
					else if (color==YELLOW) ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)Y_6);
					else if (color==BLACK) 	ILI9341_DrawImage(X0-41-g*41, Y0, 41, 64, (const uint16_t*)B_L_6);
				break;
				case 7:
					if (color==GREEN) 			ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)G_7);
					else if (color==RED) 		ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)R_7);
					else if (color==YELLOW) ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)Y_7);
					else if (color==BLACK) 	ILI9341_DrawImage(X0-41-g*41, Y0, 41, 64, (const uint16_t*)B_L_7);
				break;
				case 8:
					if (color==GREEN) 			ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)G_8);
					else if (color==RED) 		ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)R_8);
					else if (color==YELLOW) ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)Y_8);
					else if (color==BLACK) 	ILI9341_DrawImage(X0-41-g*41, Y0, 41, 64, (const uint16_t*)B_L_8);
				break;
				case 9:
					if (color==GREEN) 			ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)G_9);
					else if (color==RED) 		ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)R_9);
					else if (color==YELLOW) ILI9341_DrawImage(X0-60-g*60, Y0, 60, 106, (const uint16_t*)Y_9);
					else if (color==BLACK) 	ILI9341_DrawImage(X0-41-g*41, Y0, 41, 64, (const uint16_t*)B_L_9);
				break;
			}
	}
}


void i2c_config(void){
		/* enable GPIOB clock */
    rcu_periph_clock_enable(RCU_GPIOB);
		/* enable I2C0 clock */
    rcu_periph_clock_enable(RCU_I2C0);
	
	  /* connect PB6 to I2C0_SCL */
    /* connect PB7 to I2C0_SDA */
//  gpio_init(GPIOB, GPIO_MODE_AF_OD, GPIO_OSPEED_50MHZ, GPIO_PIN_6 | GPIO_PIN_7);
		gpio_init(GPIOB, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_6 | GPIO_PIN_7);
	
    /* cofigure I2C clock */
    i2c_clock_config(I2C0, 100000, I2C_DTCY_2);
    /* cofigure I2C address */
    i2c_mode_addr_config(I2C0, I2C_I2CMODE_ENABLE, I2C_ADDFORMAT_7BITS, I2C0_OWN_ADDRESS7);
    /* enable I2C0 */
    i2c_enable(I2C0);
    /* enable acknowledge */
    i2c_ack_config(I2C0, I2C_ACK_ENABLE);
}

void SIM_recieve_OK(void){
		usbd_ep_send (&usbd_cdc, CDC_IN_EP, "OK", 3);
}

void TFT_print(void){
		uint8_t buff[100]={0};
		uint16_t adc_1=0;
		uint8_t rang_bat=0;
	
		adc_software_trigger_enable(ADC0, ADC_REGULAR_CHANNEL);
		delay_1ms(100);		
		adc_1=adc_value[0]*3300/(0xFFF);
		
		if (adc_1<1800) return;

		if (adc_1>2430) 									rang_bat=5;
		else if (adc_1<2430 & adc_1>2364) rang_bat=5;
		else if (adc_1<2364 & adc_1>2298) rang_bat=4;
		else if (adc_1<2298 & adc_1>2232) rang_bat=3;
		else if (adc_1<2232 & adc_1>2166) rang_bat=2;
		else if (adc_1<2166 & adc_1>2100) rang_bat=1;
		else if (adc_1<2100) 							rang_bat=0;
		
		
		if (rang_bat_old!=rang_bat){	
				ILI9341_DrawImage(6, 285, 44, 24, (const uint16_t*)bat_clr);			
				for (int i1=0;i1<rang_bat;i1++){
						ILI9341_DrawImage(42-i1*8, 286, 7, 22, (const uint16_t*)bat_dif);
				}
				rang_bat_old=rang_bat;
		}		
}

void ADS1115_config(uint8_t pointer, uint8_t byte1, uint8_t byte2){
		/* wait until I2C bus is idle */
    while(i2c_flag_get(I2C0, I2C_FLAG_I2CBSY));
    /* send a start condition to I2C bus */
    i2c_start_on_bus(I2C0);
    /* wait until SBSEND bit is set */
    while(!i2c_flag_get(I2C0, I2C_FLAG_SBSEND));
		
		/* send slave address to I2C bus */
    i2c_master_addressing(I2C0, I2C0_SLAVE_ADDRESS7, I2C_TRANSMITTER);
    /* wait until ADDSEND bit is set */
    while(!i2c_flag_get(I2C0, I2C_FLAG_ADDSEND));
    /* clear ADDSEND bit */
    i2c_flag_clear(I2C0, I2C_FLAG_ADDSEND);
    /* wait until the transmit data buffer is empty */
    while(!i2c_flag_get(I2C0, I2C_FLAG_TBE));		

