evgmolt/Tonometer/gd32f303_v1/src/main.c
int16_t GetDerivative(int16_t *dataArr, int32_t Ind){
   if (Ind < (DerivativeAverageWidth+DerivativeShift)){
       return 0;
   }
   int32_t val1 = 0;
   int32_t val2 = 0;
   for (int i = 0; i < DerivativeAverageWidth; i++){
       val1 += dataArr[Ind - DerivativeAverageWidth + i];
       val2 += dataArr[Ind - DerivativeAverageWidth - DerivativeShift + i];
   }
   val1 /= DerivativeAverageWidth;
   val2 /= DerivativeAverageWidth;
   return (int16_t)(val1 - val2);
}

void GetArrayOfWaveIndexes(int16_t *valuesArray, int16_t *indexesArray, int16_t *indexes){    
    for (int i=0; i<puls_counter; i++)
    {
        puls_buff_NEW_MIN[i] = GetMinIndexInRegion(valuesArray, indexesArray[i]);
				puls_buff_AMP_MIN[i] = valuesArray[puls_buff_NEW_MIN[i]];
				indexes[i] = GetMaxIndexInRegion(valuesArray, indexesArray[i]);
				puls_buff_AMP[i]=valuesArray[indexes[i]];				
    }    
}

int GetMaxIndexInRegion(int16_t *sourceArray, int index){ 
    int range = 50;
    int16_t max = -200;
    int maxIndex = 0;
    for (int i1 = 0; i1 < range; i1++){
        //if (i - range / 2 < 0) continue;
        //if (i - range / 2 > strlen(sourceArray)) continue;
        if (sourceArray[index + i1 - range / 2] > max){
            max = sourceArray[index + i1 - range / 2];
            maxIndex = i1 - range / 2;
        }
    }		
    return index + maxIndex;
}

int GetMinIndexInRegion(int16_t *sourceArray_MIN,int index){		
		int range_MIN=100;
		int16_t min = 1000;
		int minIndex = 0;
		for (int i1 = 0; i1 < range_MIN; i1++){
				if (sourceArray_MIN[index+i1] < min){
						min=sourceArray_MIN[index+i1];
						minIndex=i1;
				}
		}			
    return index + minIndex;
}

uint8_t usb_send_slim_AMP(void){
	uint8_t send_H=(save_dir[send_counter]>>8)&0xFF;
	uint8_t send_L=save_dir[send_counter]&0xFF;
	uint8_t send_buff[3]={25,send_L,send_H};
	usbd_ep_send (&usbd_cdc, CDC_IN_EP, send_buff, 3);
	send_counter++;
	if (send_counter>=puls_counter) return 1;
	else return 0;
}
void CountEnvelopeArray(int16_t *arrayOfIndexes, int16_t *arrayOfValues){
    for (int i = 1; i < puls_counter; i++){
        int x1 = arrayOfIndexes[i - 1];
        int x2 = arrayOfIndexes[i];
        double y1 = arrayOfValues[i - 1];
        double y2 = arrayOfValues[i];
        double coeff = (y2 - y1) / (x2 - x1);
        for (int j = x1 - 1; j < x2; j++) {
            int ind = i + j;            
            EnvelopeArray[j] = y1 + coeff * (j - x1);
        }				
    }
}

void f_sorting_MAX(void){
		int16_t MaximumAmplitude=-100;
		uint8_t FLAG=1;	
		uint16_t mini_XMAX=0;
		int16_t z=0;
		uint8_t buff1[10]={0};		
		
		int level = 8;
    for (int i = 1; i < puls_counter - 1; i++){
				if (abs(puls_buff_AMP[i] - puls_buff_AMP[i - 1]) > level)
				{
						puls_buff_AMP[i] = (puls_buff_AMP[i - 1] + puls_buff_AMP[i + 1]) / 2;
				}
    }
		
		
		for (int i=0; i<puls_counter; i++){
				puls_buff_AMP[i]=puls_buff_AMP[i]-puls_buff_AMP_MIN[i];
		}
		
		for (int i=0; i<puls_counter; i++){
				if (puls_buff_AMP[i]>MaximumAmplitude){
						MaximumAmplitude=puls_buff_AMP[i];							
						mini_XMAX=i;
				}		
		}			
		
		//sprintf(buff1,"%4d",puls_counter);
		//ILI9341_WriteString(1, 50, buff1, Font_11x18, ILI9341_BLACK, ILI9341_WHITE);
		//sprintf(buff1,"%4d",mini_XMAX);
		//ILI9341_WriteString(1, 70, buff1, Font_11x18, ILI9341_BLACK, ILI9341_WHITE);
		
		while (FLAG==1){
				FLAG=0;
				for (int i=1; i<mini_XMAX; i++){
						if (puls_buff_AMP[i-1]>puls_buff_AMP[i]){
								z=puls_buff_AMP[i-1];
								puls_buff_AMP[i-1]=puls_buff_AMP[i];
								puls_buff_AMP[i]=z;
								//swap(puls_buff_AMP[i-1],puls_buff_AMP[i]);
								FLAG=1;
						}
				}
		}
		FLAG=1;
		while (FLAG==1){
				FLAG=0;
				for (int i=mini_XMAX+2; i<puls_counter; i++){
						if (puls_buff_AMP[i-1]<puls_buff_AMP[i]){
								z=puls_buff_AMP[i-1];
								puls_buff_AMP[i-1]=puls_buff_AMP[i];
								puls_buff_AMP[i]=z;
								//swap(puls_buff_AMP[i-1],puls_buff_AMP[i]);
								FLAG=1;
						}
				}
		}		
}



void f_PSys_Dia(void){
	double MaximumAmplitude=-100;
	
	for (int i=0; i<puls_counter; i++){
			if (puls_buff_AMP[i]>MaximumAmplitude){
					MaximumAmplitude=puls_buff_AMP[i];
					XMax=puls_buff_NEW[i];					
			}		
	}		
	
	int16_t ValueSys = 0.46 * MaximumAmplitude;
	int16_t ValueDia = 0.82 * MaximumAmplitude;	
	
	for (int i = XMax; i >= 200; i--){
			if (EnvelopeArray[i] < ValueSys){
					PSys = save_clear[i]/rate;
					indexPSys = i;
					break;
			}
	}
	for (int i = XMax; i < main_index; i++)
	{
    if (EnvelopeArray[i] < ValueDia)
    {
        PDia = save_clear[i]/rate;
        indexPDia = i;
        break;
    }
	}
}
uint16_t puls_convert(void){
		double level = 0.06;
		uint16_t intervals[50]={0};
		uint8_t buff1[10]={0};
		double first_puls=0;
		int16_t cur_puls=0;
		puls_out=0;
		puls_cur_counter=0;
		if (puls_counter<10) return 0;
		for (int m=3;m<puls_counter-3;m++){
				cur_puls=puls_buff[m]-puls_buff[m-1];
				if (cur_puls>LoLimit & cur_puls<HiLimit){
						first_puls+=cur_puls;
						puls_cur_counter++;
				}
		}		
		first_puls=first_puls/puls_cur_counter;
		//sprintf(buff1,"w-%3d",puls_cur_counter);
		//ILI9341_WriteString(1, 70, buff1, Font_11x18, ILI9341_BLACK, ILI9341_WHITE);
		
		puls_cur_counter=0;
		for (int m=1;m<puls_counter;m++){
				cur_puls=puls_buff[m]-puls_buff[m-1];
				if (cur_puls>LoLimit & cur_puls<HiLimit & cur_puls*1.5>first_puls & cur_puls/1.5<first_puls){
						puls_out+=cur_puls;
						intervals[puls_cur_counter]=cur_puls;
						puls_cur_counter++;	
				}
		}
		
		//sprintf(buff1,"c-%3d",puls_cur_counter);
		//ILI9341_WriteString(1, 90, buff1, Font_11x18, ILI9341_BLACK, ILI9341_WHITE);
		
		
		double Aver=puls_out/puls_cur_counter;
		double TwentyFivePercent = Aver / 4;
		int Counter = 0;
    double SumSqr = 0;
		for (int i = 0; i < puls_cur_counter; i++){
				double Diff = intervals[i] - Aver;
				if (abs(Diff) < TwentyFivePercent){
						SumSqr += Diff * Diff;
						Counter++;
				}
    }
		//sprintf(buff1,"c-%3d",Counter);
		//ILI9341_WriteString(1, 110, buff1, Font_11x18, ILI9341_BLACK, ILI9341_WHITE);
		
		double SKO = sqrt(SumSqr/Counter);
		if ((SKO/Aver)>level) {
				ILI9341_DrawImage(65, 245, 45, 27, (const uint16_t*)heartX3);
		}		
		
		puls_out=60/(puls_out/(puls_cur_counter*frequency));
		return puls_out;
}


